import pandas as pd

pd.set_option("display.max_colwidth",-1)

df = pd.read_csv("./map/static/중구.csv", encoding="cp949")

keywords = ["광희동","남학동","묵정동","방산동","산림동", "수표동", "신당동", "쌍림동",
           "예관동", "오장동", "을지로 3가", "을지로 4가", "을지로 5가", "을지로 6가",
           "을지로 7가", "인현동", "입정동", "장충동", "저동 2가", "주교동", "주자동", "초동",
           "충무로 3가","충무로 4가","충무로 5가", "필동", "황학동", "흥인동", "예장동",
           "삼일대로 2", "삼일대로 14", "삼일대로 16", "삼일대로 16-4", "삼일대로 16-5",
           "삼일대로 16-6","삼일대로 16-7", "삼일대로 16-9","삼일대로 18","삼일대로 20",
           "삼일대로 22", "삼일대로 22-1", "을지로 95", "을지로 95-1", "을지로 95-2",
           "을지로 97", "을지로 97-1", "을지로 99", "을지로 99-1", "을지로 100", "을지로 101",
           "을지로 101-1", "을지로 103", "을지로 103-1", "을지로 105", "을지로 9길 2", "을지로 9길 6",
           "을지로 9길 8", "삼일대로 330", "삼일대로 340", "삼일대로 298", "삼일대로 300", "삼일대로 300-1",
           "삼일대로 302", "삼일대로 304","삼일대로 308", "삼일대로4길2", "삼일대로 4길 6","삼일대로 4길 8",
           "삼일대로 4길 9", "삼일대로 4길 11","삼일대로 4길 12","삼일대로 4길 13","삼일대로 4길 14",
           "삼일대로 4길 16","삼일대로 4길 17","삼일대로 4길 18","삼일대로 4길 19","삼일대로 4길 19-1",
           "삼일대로6길 2","삼일대로6길 5","삼일대로6길 11","삼일대로6길 13","삼일대로6길 14","삼일대로6길 15",
           "삼일대로6길16","삼일대로6길 17","삼일대로6길20", "삼일대로8길 5","삼일대로8길 9","삼일대로8길 12",
           "삼일대로8길13","삼일대로8길 14","삼일대로8길 15","삼일대로8길 16","삼일대로8길1 7","삼일대로8길 19",
           "삼일대로8길20","삼일대로8길 20-1", "수표로1", "수표로3", "수표로3-3", "수표로3-5","수표로3-6",
           "수표로3-8", "수표로5", "수표로7", "수표로9", "수표로11", "수표로11-1", "수포로11-2", "수표로13",
           "수표로15", "수표로15-1", "수표로17", "수표로19", "퇴계로157", "퇴계로159-6", "퇴계로159-8",
           "퇴계로159-10", "퇴계로161", "퇴계로163", "퇴계로163-1", "퇴계로165"]

keywords_2 = ["소파로 89", "소파로 91", "소파로 91-1", "소파로 91-3", "소파로 91-7",
            "소파로 91-9", "소파로 91-10", "소파로 91-11", "소파로 91-13", "소파로 93", "소파로 95", "소파로 97", "소파로 103", "소파로 105-1",
            "소파로 107", "퇴계로20나길 15-10", "퇴계로20나길 15-12", "퇴계로20나길 15-16", "퇴계로20나길 15-20", "퇴계로20나길 15-22", "퇴계로20나길 15-28",
            "퇴계로20나길 17", "퇴계로20나길 19", "퇴계로20나길 23", "퇴계로20나길 25", "퇴계로20나길 27", "퇴계로20나길 31", "퇴계로20나길 31-3", "퇴계로20나길 31-5",
            "퇴계로20나길 31-6", "퇴계로20나길 31-7"]

for keyword in keywords_2:
    excluded = df[(df["소재지도로명주소"].str.contains(keywords) == True) | (df["소재지지번주소"].str.contains(keyword) == True)].index
    df = df.drop(excluded)

df.columns = ["management", "S_address", "L_address", "purpose", "camera_num", "camera_pixel", "shoot_info", "storage_days", "installed_date", "phone", "latitude", "longitude", "data_date"]

count=1
for keyword in keywords:
    dfFiltered = df[(df["S_address"].str.contains(keyword)==True)|(df["L_address"].str.contains(keyword)==True)]
    if len(dfFiltered)>0:
        if count==1:
            dfFiltered.to_csv("./map/static/data/서울중부경찰서.csv", mode="a", index=False, header=True, encoding="utf-8")
        else:
            dfFiltered.to_csv("./map/static/data/서울중부경찰서.csv", mode="a", index=False, header=False, encoding="utf-8")
    count+=1
